Tinyu-Zhao/Arduino-Boards/boards.txt
m5stack-coreink.menu.PartitionScheme.default=Default
m5stack-coreink.menu.PartitionScheme.default.build.partitions=default
m5stack-coreink.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stack-coreink.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-coreink.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack-coreink.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stack-coreink.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-coreink.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-coreink.menu.UploadSpeed.921600=921600
m5stack-coreink.menu.UploadSpeed.921600.upload.speed=921600
m5stack-coreink.menu.UploadSpeed.115200=115200
m5stack-coreink.menu.UploadSpeed.115200.upload.speed=115200
m5stack-coreink.menu.UploadSpeed.256000.windows=256000
m5stack-coreink.menu.UploadSpeed.256000.upload.speed=256000
m5stack-coreink.menu.UploadSpeed.230400.windows.upload.speed=256000
m5stack-coreink.menu.UploadSpeed.230400=230400
m5stack-coreink.menu.UploadSpeed.230400.upload.speed=230400
m5stack-coreink.menu.UploadSpeed.460800.linux=460800
m5stack-coreink.menu.UploadSpeed.460800.macosx=460800
m5stack-coreink.menu.UploadSpeed.460800.upload.speed=460800
m5stack-coreink.menu.UploadSpeed.512000.windows=512000
m5stack-coreink.menu.UploadSpeed.512000.upload.speed=512000
m5stack-coreink.menu.UploadSpeed.1500000=1500000
m5stack-coreink.menu.UploadSpeed.1500000.upload.speed=1500000

m5stack-coreink.menu.DebugLevel.none=None
m5stack-coreink.menu.DebugLevel.none.build.code_debug=0
m5stack-coreink.menu.DebugLevel.error=Error
m5stack-coreink.menu.DebugLevel.error.build.code_debug=1
m5stack-coreink.menu.DebugLevel.warn=Warn
m5stack-coreink.menu.DebugLevel.warn.build.code_debug=2
m5stack-coreink.menu.DebugLevel.info=Info
m5stack-coreink.menu.DebugLevel.info.build.code_debug=3
m5stack-coreink.menu.DebugLevel.debug=Debug
m5stack-coreink.menu.DebugLevel.debug.build.code_debug=4
m5stack-coreink.menu.DebugLevel.verbose=Verbose
m5stack-coreink.menu.DebugLevel.verbose.build.code_debug=5

m5stack-coreink.menu.EraseFlash.none=Disabled
m5stack-coreink.menu.EraseFlash.none.upload.erase_cmd=
m5stack-coreink.menu.EraseFlash.all=Enabled
m5stack-coreink.menu.EraseFlash.all.upload.erase_cmd=-e

###############################################################

stamp-pico.name=STAMP-PICO

stamp-pico.upload.tool=esptool_py
stamp-pico.upload.maximum_size=1310720
stamp-pico.upload.maximum_data_size=327680
stamp-pico.upload.flags=
stamp-pico.upload.extra_flags=

stamp-pico.serial.disableDTR=true
stamp-pico.serial.disableRTS=true

stamp-pico.build.tarch=xtensa
stamp-pico.build.bootloader_addr=0x1000
stamp-pico.build.target=esp32
stamp-pico.build.mcu=esp32
stamp-pico.build.core=esp32
stamp-pico.build.variant=m5stack_stamp_pico
stamp-pico.build.board=STAMP_PICO

stamp-pico.build.f_cpu=240000000L
stamp-pico.build.flash_size=4MB
stamp-pico.build.flash_freq=80m
stamp-pico.build.flash_mode=dio
stamp-pico.build.boot=dio
stamp-pico.build.partitions=default
stamp-pico.build.defines=

stamp-pico.menu.PartitionScheme.default=Default
stamp-pico.menu.PartitionScheme.default.build.partitions=default
stamp-pico.menu.PartitionScheme.no_ota=No OTA (Large APP)
stamp-pico.menu.PartitionScheme.no_ota.build.partitions=no_ota
stamp-pico.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
stamp-pico.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
stamp-pico.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
stamp-pico.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080


stamp-pico.menu.UploadSpeed.1500000=1500000
stamp-pico.menu.UploadSpeed.1500000.upload.speed=1500000
stamp-pico.menu.UploadSpeed.750000=750000
stamp-pico.menu.UploadSpeed.750000.upload.speed=750000
stamp-pico.menu.UploadSpeed.500000=500000
stamp-pico.menu.UploadSpeed.500000.upload.speed=500000
stamp-pico.menu.UploadSpeed.250000=250000
stamp-pico.menu.UploadSpeed.250000.upload.speed=250000
stamp-pico.menu.UploadSpeed.115200=115200
stamp-pico.menu.UploadSpeed.115200.upload.speed=115200

stamp-pico.menu.DebugLevel.none=None
stamp-pico.menu.DebugLevel.none.build.code_debug=0
stamp-pico.menu.DebugLevel.error=Error
stamp-pico.menu.DebugLevel.error.build.code_debug=1
stamp-pico.menu.DebugLevel.warn=Warn
stamp-pico.menu.DebugLevel.warn.build.code_debug=2
stamp-pico.menu.DebugLevel.info=Info
stamp-pico.menu.DebugLevel.info.build.code_debug=3
stamp-pico.menu.DebugLevel.debug=Debug
stamp-pico.menu.DebugLevel.debug.build.code_debug=4
stamp-pico.menu.DebugLevel.verbose=Verbose
stamp-pico.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

stamp-c3.name=STAMP-C3
stamp-c3.vid.0=0x303a
stamp-c3.pid.0=0x1001

stamp-c3.upload.tool=esptool_py
stamp-c3.upload.maximum_size=1310720
stamp-c3.upload.maximum_data_size=327680
stamp-c3.upload.flags=
stamp-c3.upload.extra_flags=
stamp-c3.upload.use_1200bps_touch=false
stamp-c3.upload.wait_for_upload_port=false

stamp-c3.serial.disableDTR=false
stamp-c3.serial.disableRTS=false

stamp-c3.build.tarch=riscv32
stamp-c3.build.target=esp
stamp-c3.build.mcu=esp32c3
stamp-c3.build.core=esp32
stamp-c3.build.variant=m5stack_stamp_c3
stamp-c3.build.board=STAMP_C3
stamp-c3.build.bootloader_addr=0x0

stamp-c3.build.cdc_on_boot=0
stamp-c3.build.f_cpu=160000000L
stamp-c3.build.flash_size=4MB
stamp-c3.build.flash_freq=80m
stamp-c3.build.flash_mode=qio
stamp-c3.build.boot=qio
stamp-c3.build.partitions=default
stamp-c3.build.defines=

stamp-c3.menu.CDCOnBoot.default=Disabled
stamp-c3.menu.CDCOnBoot.default.build.cdc_on_boot=0
stamp-c3.menu.CDCOnBoot.cdc=Enabled
stamp-c3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

stamp-c3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
stamp-c3.menu.PartitionScheme.default.build.partitions=default
stamp-c3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
stamp-c3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
stamp-c3.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
stamp-c3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
stamp-c3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
stamp-c3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
stamp-c3.menu.PartitionScheme.minimal.build.partitions=minimal
stamp-c3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
stamp-c3.menu.PartitionScheme.no_ota.build.partitions=no_ota
stamp-c3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
stamp-c3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
stamp-c3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
stamp-c3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
stamp-c3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
stamp-c3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
stamp-c3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
stamp-c3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
stamp-c3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
stamp-c3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
stamp-c3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
stamp-c3.menu.PartitionScheme.huge_app.build.partitions=huge_app
stamp-c3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
stamp-c3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
stamp-c3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
stamp-c3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
stamp-c3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
stamp-c3.menu.PartitionScheme.fatflash.build.partitions=ffat
stamp-c3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
stamp-c3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
stamp-c3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
stamp-c3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

stamp-c3.menu.CPUFreq.160=160MHz (WiFi)
stamp-c3.menu.CPUFreq.160.build.f_cpu=160000000L
stamp-c3.menu.CPUFreq.80=80MHz (WiFi)
stamp-c3.menu.CPUFreq.80.build.f_cpu=80000000L
stamp-c3.menu.CPUFreq.40=40MHz
stamp-c3.menu.CPUFreq.40.build.f_cpu=40000000L
stamp-c3.menu.CPUFreq.20=20MHz
stamp-c3.menu.CPUFreq.20.build.f_cpu=20000000L
stamp-c3.menu.CPUFreq.10=10MHz
stamp-c3.menu.CPUFreq.10.build.f_cpu=10000000L

stamp-c3.menu.FlashMode.qio=QIO
stamp-c3.menu.FlashMode.qio.build.flash_mode=dio
stamp-c3.menu.FlashMode.qio.build.boot=qio
stamp-c3.menu.FlashMode.dio=DIO
stamp-c3.menu.FlashMode.dio.build.flash_mode=dio
stamp-c3.menu.FlashMode.dio.build.boot=dio
stamp-c3.menu.FlashMode.qout=QOUT
stamp-c3.menu.FlashMode.qout.build.flash_mode=dout
stamp-c3.menu.FlashMode.qout.build.boot=qout
stamp-c3.menu.FlashMode.dout=DOUT
stamp-c3.menu.FlashMode.dout.build.flash_mode=dout
stamp-c3.menu.FlashMode.dout.build.boot=dout

stamp-c3.menu.FlashFreq.80=80MHz
stamp-c3.menu.FlashFreq.80.build.flash_freq=80m
stamp-c3.menu.FlashFreq.40=40MHz
stamp-c3.menu.FlashFreq.40.build.flash_freq=40m

stamp-c3.menu.FlashSize.4M=4MB (32Mb)
stamp-c3.menu.FlashSize.4M.build.flash_size=4MB
stamp-c3.menu.FlashSize.8M=8MB (64Mb)
stamp-c3.menu.FlashSize.8M.build.flash_size=8MB
stamp-c3.menu.FlashSize.8M.build.partitions=default_8MB
stamp-c3.menu.FlashSize.2M=2MB (16Mb)
stamp-c3.menu.FlashSize.2M.build.flash_size=2MB
stamp-c3.menu.FlashSize.2M.build.partitions=minimal
stamp-c3.menu.FlashSize.16M=16MB (128Mb)
stamp-c3.menu.FlashSize.16M.build.flash_size=16MB

stamp-c3.menu.UploadSpeed.921600=921600
stamp-c3.menu.UploadSpeed.921600.upload.speed=921600
stamp-c3.menu.UploadSpeed.115200=115200
stamp-c3.menu.UploadSpeed.115200.upload.speed=115200
stamp-c3.menu.UploadSpeed.256000.windows=256000
stamp-c3.menu.UploadSpeed.256000.upload.speed=256000
stamp-c3.menu.UploadSpeed.230400.windows.upload.speed=256000
stamp-c3.menu.UploadSpeed.230400=230400
stamp-c3.menu.UploadSpeed.230400.upload.speed=230400
stamp-c3.menu.UploadSpeed.460800.linux=460800
stamp-c3.menu.UploadSpeed.460800.macosx=460800
stamp-c3.menu.UploadSpeed.460800.upload.speed=460800
stamp-c3.menu.UploadSpeed.512000.windows=512000
stamp-c3.menu.UploadSpeed.512000.upload.speed=512000

stamp-c3.menu.DebugLevel.none=None
stamp-c3.menu.DebugLevel.none.build.code_debug=0
stamp-c3.menu.DebugLevel.error=Error
stamp-c3.menu.DebugLevel.error.build.code_debug=1
stamp-c3.menu.DebugLevel.warn=Warn
stamp-c3.menu.DebugLevel.warn.build.code_debug=2
stamp-c3.menu.DebugLevel.info=Info
stamp-c3.menu.DebugLevel.info.build.code_debug=3
stamp-c3.menu.DebugLevel.debug=Debug
stamp-c3.menu.DebugLevel.debug.build.code_debug=4
stamp-c3.menu.DebugLevel.verbose=Verbose
stamp-c3.menu.DebugLevel.verbose.build.code_debug=5

###############################################################
